org/roam/20200608013621-linux.html
<!doctype html>
<html lang="en">
<head>
<title>linux</title>
<!-- 2020-06-09 二 13:21 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="zhou mingjun">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Linux</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. distros</a></li>
<li><a href="#sec-1-2">1.2. wget</a></li>
<li><a href="#sec-1-3">1.3. iptables</a></li>
<li><a href="#sec-1-4">1.4. ssh</a></li>
<li><a href="#sec-1-5">1.5. KDE</a></li>
<li><a href="#sec-1-6">1.6. i3</a></li>
<li><a href="#sec-1-7">1.7. macbook</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">linux</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Linux</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> distros</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> archlinux</h4>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> debian</h4>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> wget</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 需要下载某个目录下面的所有文件。</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
命令如下
wget -c -r -np -k -L -p <a href="http://docs.openstack.org/liberty/install-guide-rdo/">http://docs.openstack.org/liberty/install-guide-rdo/</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 在下载时。有用到外部域名的图片或连接。如果需要同时下载就要用-H参数。</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
wget -np -nH -r –span-hosts www.xianren.org/pub/path/
-c 断点续传
-r 递归下载，下载指定网页某一目录下（包括子目录）的所有文件
-nd 递归下载时不创建一层一层的目录，把所有的文件下载到当前目录
-np 递归下载时不搜索上层目录，如wget -c -r www.xianren.org/pub/path/
没有加参数-np，就会同时下载path的上一级目录pub下的其它文件
-k 将绝对链接转为相对链接，下载整个站点后脱机浏览网页，最好加上这个参数
-L 递归时不进入其它主机，如wget -c -r www.xianren.org/
如果网站内有一个这样的链接：
www.xianren.org，不加参数-L，就会像大火烧山一样，会递归下载www.xianren.org网站
-p 下载网页所需的所有文件，如图片等
-A 指定要下载的文件样式列表，多个样式用逗号分隔
-i 后面跟一个文件，文件内指明要下载的URL
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> iptables</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-bash">How to set linux server as gateway?

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">set ip forward</span>
<span style="color: #ECBE7B;">echo</span> <span style="color: #da8548; font-weight: bold;">1</span> &gt; /proc/sys/net/ipv4/ip_forward
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">set iptables, $IF_EXTERNAL is external interface, $EX_EXTERNAL is internal interface</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">IF_INTERNAL</span>=
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">IF_EXTERNAL</span>=
iptables -t nat -A POSTROUTING -o $<span style="color: #dcaeea;">IF_EXTERNAL</span> -j MASQUERADE
iptables -A FORWARD -i $<span style="color: #dcaeea;">IF_INTERNAL</span> -o $<span style="color: #dcaeea;">IF_EXTERNAL</span> -j ACCEPT
iptables -A FORWARD -i $<span style="color: #dcaeea;">IF_EXTERNAL</span> -o $<span style="color: #dcaeea;">IF_INTERNAL</span> -m state --state RELATED,ESTABLISHED -j ACCEPT
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> ssh</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> -L [bind<sub>address</sub>:]port:host:hostport</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">

<pre class="src src-bash">ssh -L 2210:10.53.7.32:22 jump01.bj.sensetime.com
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> -R [bind<sub>address</sub>:]port:host:hostport</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
所谓“反向代理”就是让远端启动端口，把远端端口数据转发到本地。
HostA 将自己可以访问的 HostB:PortB 暴露给外网服务器 HostC:PortC，在 HostA 上运行：
那么链接 HostC:PortC 就相当于链接 HostB:PortB。使用时需修改 HostC 的 /etc/ssh/sshd<sub>config</sub>，添加：
GatewayPorts yes
</p>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">ssh -R HostC:PortC:HostB:PortB  user@HostC</span>
ssh -R 10.0.0.254:9999:10.0.0.22:8888 10.0.0.254

</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> -D [bind<sub>address</sub>:]port</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
在 HostA 的本地 1080 端口启动一个 socks5 服务，通过本地 socks5 代理的数据会通过 ssh 链接先发送给 HostB，再从 HostB 转发送给远程主机：
那么在 HostA 上面，浏览器配置 socks5 代理为 127.0.0.1:1080，看网页时就能把数据通过 HostB 代理出去，类似 ss/ssr 版本，只不过用 ssh 来实现。
</p>

<p>
#+BEGIN<sub>SRC</sub> bash
ssh -D localhost:1080  HostB
</p>

<p>
#+END<sub>SRC</sub>`
</p>
</div>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> tunning</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
为了更好用一点，ssh 后面还可以加上：-CqTnN 参数，比如：
</p>
<div class="org-src-container">

<pre class="src src-bash">ssh -CqTnN -L 0.0.0.0:PortA:HostC:PortC  user@HostB
</pre>
</div>
<p>
其中 -C 为压缩数据，-q 安静模式，-T 禁止远程分配终端，-n 关闭标准输入，-N 不执行远程命令。此外视需要还可以增加 -f 参数，把 ssh 放到后台运行。
这些 ssh 代理没有短线重连功能，链接断了命令就退出了，所以需要些脚本监控重启，或者使用 autossh 之类的工具保持链接。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> KDE</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> kDE plasma tips</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
<a href="https://userbase.kde.org/Plasma/Tips">Plasma/Tips - KDE UserBase Wiki</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> windows/meta key</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
.config/kwinrc
</p>

<div class="org-src-container">

<pre class="src src-text">[ModifierOnlyShortcuts]
Alt=org.kde.kglobalaccel,/component/kwin,,invokeShortcut,Expose
Control=
Meta=org.kde.plasmashell,/PlasmaShell,org.kde.PlasmaShell,activateLauncherMenu
Shift=
</pre>
</div>

<div class="org-src-container">

<pre class="src src-shell">kwriteconfig5 --file ~/.config/kwinrc --group ModifierOnlyShortcuts --key Meta <span style="color: #98be65;">"org.kde.plasmashell,/PlasmaShell,org.kde.PlasmaShell,activateLauncherMenu"</span>
qdbus org.kde.KWin /KWin reconfigure

</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> set google-chrome as default browser</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
reference to : <a href="http://gregladen.com/blog/2019/02/16/chrome-as-default-browser-in-kde-plasma-getting-it-to-stick/">http://gregladen.com/blog/2019/02/16/chrome-as-default-browser-in-kde-plasma-getting-it-to-stick/</a>
</p>

<p>
Go ahead and chose “chromium” as the default browser in the “settings” application, and hit apply. That setting will likely stick, but Chrome will not be the default browser anyway. A bug in KDE Plasma prevents this, but you can drill down deeper into the configuration information and make it work:
Go to your settings tool.
Go to Configure File Associations
Filter the list for “html”
Find the entry for xhtml+xml and move “Chromium” to the top of the list.
Do the same for “html”
Hit “apply.”
Your problem is probably now solved.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> i3</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<a href="https://tunkshif.github.io/linux/i3-config.html">桌面环境微科普与 i3 配置记录</a>
</p>
</div>
<div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> xrandr</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
<a href="https://ubuntuforums.org/showthread.php?t=1112186">{ubuntu} xrandr add screen resolution</a>
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">check maxium buffer</span>
xrandr | <span style="color: #ECBE7B;">grep</span> maximum

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">use gtf to create a mode line</span>
gtf <span style="color: #da8548; font-weight: bold;">1440</span> <span style="color: #da8548; font-weight: bold;">900</span> <span style="color: #da8548; font-weight: bold;">59.9</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">add new mode using xrandr</span>
xrandr --newmode <span style="color: #98be65;">"1440x900_59.90"</span>  <span style="color: #da8548; font-weight: bold;">106.29</span>  <span style="color: #da8548; font-weight: bold;">1440</span> <span style="color: #da8548; font-weight: bold;">1520</span> <span style="color: #da8548; font-weight: bold;">1672</span> <span style="color: #da8548; font-weight: bold;">1904</span>  <span style="color: #da8548; font-weight: bold;">900</span> <span style="color: #da8548; font-weight: bold;">901</span> <span style="color: #da8548; font-weight: bold;">904</span> <span style="color: #da8548; font-weight: bold;">932</span>  -HSync +Vsync

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">add new mode to desired output</span>
xrandr --addmode VIRTUAL1 1440x900_59.90

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">choose new mode</span>
xrandr --output VIRTUAL1 --mode 1440x900_59.90


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> macbook</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> power management</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
please refer to <a href="https://wiki.archlinux.org/index.php/Mac">Mac - ArchWiki</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> touchpad</h4>
<div class="outline-text-4" id="text-1-7-2">
<pre class="example">
/etc/X11/xorg.conf.d/30-touchpad.conf
Section "InputClass"
    Identifier "touchpad"
    Driver "libinput"
    MatchIsTouchpad "on"
    Option "Tapping" "on"
    Option "TappingButtonMap" "lmr"
EndSection
</pre>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: zhou mingjun</p>
<p class="date">Created: 2020-06-09 二 13:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="http://orgmode.org">Org-mode</a> 9.4)</p>
</div>
</footer>
</body>
</html>
